set_input_delay 0 [all_inputs]

set_output_delay 0 [all_outputs]

set_max_delay 5 -from [all_inputs] -to [all_outputs]



